In [1]:
#!pip install pandas
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\admin\anaconda3\lib\site-packages (from pandasql) (1.21.5)
Requirement already satisfied: pandas in c:\users\admin\anaconda3\lib\site-packages (from pandasql) (1.4.4)
Requirement already satisfied: sqlalchemy in c:\users\admin\anaconda3\lib\site-packages (from pandasql) (1.4.39)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\anaconda3\lib\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\admin\anaconda3\lib\site-packages (from sqlalchemy->pandasql) (1.1.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py): started
  Building wheel for pandasql (setup.py): finished with status 'done'
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26768 sha256=efc2a04c28dd2762f463243290a3eae76cb5c03f76d87eccd7eaacabe00e90d1
  Stored in directory: c:\users\admin\appdata\local\pip\cache\wheels\63\e8\ec\75b1df467ecf57b6ececb32cb16f4e86697cbfe55cb0c51f07
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [2]:
import pandas as pd
from pandasql import sqldf

In [3]:
df=pd.read_csv("ipl_2022_dataset.csv")

In [5]:
df = pd.read_csv("ipl_2022_dataset.csv", index_col=0)

df.head()

,Player,Base Price,TYPE,COST IN ₹ (CR.),Cost IN $ (000),2021 Squad,Team
0,Rashid Khan,Draft Pick,BOWLER,15.0,1950.0,SRH,Gujarat Titans
1,Hardik Pandya,Draft Pick,ALL-ROUNDER,15.0,1950.0,MI,Gujarat Titans
2,Lockie Ferguson,2 Cr,BOWLER,10.0,1300.0,KKR,Gujarat Titans
3,Rahul Tewatia,40 Lakh,ALL-ROUNDER,9.0,1170.0,RR,Gujarat Titans
4,Shubman Gill,Draft Pick,BATTER,8.0,1040.0,KKR,Gujarat Titans

In [6]:
#Total number of rows and columns
print('Total number of Rows: ', df.shape[0])
print('Total number of Columns: ', df.shape[1])

Total number of Rows:  633
Total number of Columns:  7

In [7]:
#Data Types

df.dtypes

Player              object
Base Price          object
TYPE                object
COST IN ₹ (CR.)    float64
Cost IN $ (000)    float64
2021 Squad          object
Team                object
dtype: object

In [8]:
#Unique Values in 'Base Price' Column

df['Base Price'].unique()

array(['Draft Pick', '2 Cr', '40 Lakh', '20 Lakh', '1 Cr', '75 Lakh',
       '50 Lakh', '30 Lakh', 'Retained', '1.5 Cr'], dtype=object)

In [9]:
#Distribution of values inside column 'Base Price'

df['Base Price'].value_counts()

20 Lakh       344
50 Lakh       104
2 Cr           48
1 Cr           33
Retained       27
75 Lakh        26
1.5 Cr         20
40 Lakh        16
30 Lakh         9
Draft Pick      6
Name: Base Price, dtype: int64

In [10]:
#Unique Values in 'TYPE' Column

df['TYPE'].unique()

array(['BOWLER', 'ALL-ROUNDER', 'BATTER', 'WICKETKEEPER'], dtype=object)

In [11]:
#Distribution of values inside column 'Base Price'

df['TYPE'].value_counts(normalize=True)

ALL-ROUNDER     0.382306
BOWLER          0.339652
BATTER          0.176935
WICKETKEEPER    0.101106
Name: TYPE, dtype: float64

In [12]:
#Rename columns and save it in the variable df2

df2=df.rename(columns={'Player':'player',
                       'Base Price':'base_price',
                       'TYPE':'type',
                       'COST IN ₹ (CR.)':'cost_inr',
                       'Cost IN $ (000)': 'cost_usd',
                       '2021 Squad':'2021_team',
                       'Team':'2022_team'})

In [13]:
#Dropping USD Column

df3 = df2.drop(['cost_usd'],axis=1)

In [14]:
#Check updated Dataframe

df3.head()

,player,base_price,type,cost_inr,2021_team,2022_team
0,Rashid Khan,Draft Pick,BOWLER,15.0,SRH,Gujarat Titans
1,Hardik Pandya,Draft Pick,ALL-ROUNDER,15.0,MI,Gujarat Titans
2,Lockie Ferguson,2 Cr,BOWLER,10.0,KKR,Gujarat Titans
3,Rahul Tewatia,40 Lakh,ALL-ROUNDER,9.0,RR,Gujarat Titans
4,Shubman Gill,Draft Pick,BATTER,8.0,KKR,Gujarat Titans

In [15]:
mysql = lambda q: sqldf(q, globals())

In [16]:
mysql("""SELECT player, cost_inr FROM df3 WHERE type = 'BATTER' ORDER BY 2 DESC LIMIT 3""")

            player  cost_inr
0     Rohit Sharma      16.0
1      Virat Kohli      15.0
2  Kane Williamson      14.0

In [17]:
#2-Top 5 bowlers who got paid the most?

mysql("""SELECT player, cost_inr FROM df3 WHERE type = 'BOWLER' ORDER By 2 DESC LIMIT 5 """)

            player  cost_inr
0      Rashid Khan     15.00
1    Deepak Chahar     14.00
2   Jasprit Bumrah     12.00
3   Shardul Thakur     10.75
4  Lockie Ferguson     10.00

In [18]:
mysql("""SELECT player, cost_inr FROM df3 WHERE type = 'BATTER' ORDER BY 2 DESC LIMIT 3""")

            player  cost_inr
0     Rohit Sharma      16.0
1      Virat Kohli      15.0
2  Kane Williamson      14.0

In [19]:
mysql(""" SELECT player, cost_inr FROM df3 WHERE type = 'WICKETKEEPER' AND cost_inr is not null ORDER BY 2 LIMIT 5 """)

            player  cost_inr
0    N. Jagadeesan       0.2
1   Baba Indrajith       0.2
2    Jitesh Sharma       0.2
3      Aryan Juyal       0.2
4  Luvnith Sisodia       0.2

In [20]:
mysql("""SELECT type, round(avg(cost_inr),2) average_price FROM df3 GROUP BY 1 ORDER BY 2 DESC""")

           type  average_price
0  WICKETKEEPER           5.09
1        BATTER           4.11
2   ALL-ROUNDER           3.61
3        BOWLER           3.07

In [21]:
mysql("""SELECT player, cost_inr FROM df3 WHERE base_price ="Retained" ORDER BY 2 DESC LIMIT 5 """)

            player  cost_inr
0  Ravindra Jadeja      16.0
1     Rishabh Pant      16.0
2     Rohit Sharma      16.0
3      Virat Kohli      15.0
4     Sanju Samson      14.0